foam_controlwrapper/examples/poiseuille/constant/polyMesh/blockMeshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object blockMeshDict;
}

convertToMeters 1;

vertices
  (
    (0.0  0.0  0.0)
    (0.02  0.0  0.0)
    (0.02  0.001  0.0)
    (0.0  0.001  0.0)
    (0.0  0.0  0.1)
    (0.02  0.0  0.1)
    (0.02  0.001  0.1)
    (0.0  0.001  0.1)
  );

blocks
  (
    hex (0 1 2 3 4 5 6 7) (10 4 1) simpleGrading (1 1 1)
  );

edges
  (
  );

boundary
  (
    boundary2

    {
      type patch;
      faces
        (

          (
            3
            7
            6
            2
          )

          (
            1
            5
            4
            0
          )
        );

    }
    boundary0

    {
      type patch;
      faces
        (

          (
            0
            4
            7
            3
          )
        );

    }
    boundary1

    {
      type patch;
      faces
        (

          (
            2
            6
            5
            1
          )
        );

    }
    boundary3

    {
      type empty;
      faces
        (

          (
            0
            3
            2
            1
          )

          (
            4
            5
            6
            7
          )
        );

    }
  );

mergePatchPairs
  (
  ); 	// ************************************************************************* //

