foam_controlwrapper/examples/poiseuille/constant/RASProperties


FoamFile
{
    version     2.2;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      RASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    
RASModel            laminar;

turbulence          off;

printCoeffs         on;
                        