foam_controlwrapper/examples/poiseuille/constant/turbulenceProperties


FoamFile
{
    version     2.2;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    
simulationType laminar;
                        