foam_controlwrapper/examples/poiseuille/0/p


FoamFile
{
    version     2.2;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    
dimensions [ 0 2 -2 0 0 0 0 ];

internalField uniform 0;

boundaryField
{

}
                    