foam_controlwrapper/examples/poiseuille/system/decomposeParDict


FoamFile
{
    version     2.2;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    
numberOfSubdomains 4;

method          scotch;

                        